<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version (12) of Komodo Edit.
    </string>
    <key>Identifier</key>
    <string>com.github.timsutton.download.KomodoEdit</string>
    <key>Input</key>
    <dict>
        <key>CHECK_FILESIZE_ONLY</key>
        <true/>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.activestate.com/komodo-ide/downloads/edit</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://.*?Komodo-Edit.*?dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Komodo Edit 12.app</string>
                <key>requirement</key>
                <string>identifier "com.activestate.KomodoEdit" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6L3MMJ36R9"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
